[
    {
        "year": "25.000TCN - 7.000TCN",
        "title": "Văn hóa Soi Nhụ",
        "content": "Văn hóa Soi Nhụ gọi theo tên địa điểm khảo cổ học Soi Nhụ thuộc vịnh Bái Tử Long, là nền văn hóa của người tiền sử được các nhà khảo cổ học Việt Nam phát hiện năm 1964 và khai quật năm 1967.",
        "thoiky": "tiensu"
    },
    {
        "year": "23.000 TCN",
        "title": "Văn hóa Ngườm",
        "content": "Kỹ nghệ Ngườm là một kỹ nghệ chế tác công cụ lao động từ đá của người nguyên thủy thời hậu kỳ Đá cũ. ",
        "thoiky": "tiensu"
    },
    {
        "year": "23.000TCN - 1.000 TCN",
        "title": "Văn hóa Tràng An",
        "content": "Văn hóa Tràng An là một nền văn hóa cổ ở Việt Nam, hình thành từ thời kỳ đồ đá cũ cách nay khoảng 25 ngàn năm. Tràng An là tên một địa danh ở Ninh Bình, nơi đầu tiên tìm ra những di chỉ của nền văn hóa này. Và hiện nay, đã tìm ra được khoảng 30 địa điểm có nền văn hóa Tràng An",
        "thoiky": "tiensu"
    },
    {
        "year": "20.000TCN - 12.000TCN",
        "title": "Văn hóa Sơn Vi",
        "content": "Văn hóa Sơn Vi là một nền văn hóa ở Việt Nam vào hậu kỳ thời đại đồ đá cũ cách ngày nay khoảng 16.000 đến 9.000 năm.[1] Đây là nền văn hóa kế trước văn hóa Hòa Bình.Đến nay đã có khoảng 160 địa điểm thuộc văn hóa Sơn Vi đã được phát hiện.",
        "thoiky": "tiensu"
    },
    {
        "year": "12.000TCN - 10.000TCN",
        "title": "Văn hóa Hoà Bình",
        "content": "Văn hóa Hòa Bình thuộc thời đại đồ đá cũ sang thời đại đồ đá mới (cách ngày nay 15.000 năm, kéo dài đến 2.000 năm trước Công Nguyên),Văn hóa Hòa Bình được giới khảo cổ học chính thức công nhận từ ngày 30 tháng 1 năm 1932, do đề xuất của Madeleine Colani, sau khi đã được Đại hội các nhà Tiền sử Viễn Đông họp tại Hà Nội thông qua. ",
        "thoiky": "tiensu"
    },
    {
        "year": "10.000TCN - 8.000 TCN",
        "title": "Văn hóa Bắc Sơn",
        "content": "Văn hóa Bắc Sơn là một nền văn hóa cổ đại Việt Nam ở sơ kỳ thời đại đồ đá mới có niên đại sau nền văn hóa Hòa Bình, cách ngày nay từ một vạn đến tám ngàn năm.",
        "thoiky": "tiensu"
    },
    {
        "year": "8.000TCN - 6.000 TCN",
        "title": "Văn hóa Quỳnh Văn",
        "content": "Văn hóa Quỳnh Văn (thời đại đồ đá mới, khoảng 6.000 – 3.500 năm cách ngày nay) được phát hiện từ những năm 1930 bởi các học giả người Pháp. Cho đến nay đã có hơn 70 năm nghiên cứu với 21 di tích",
        "thoiky": "tiensu"
    },
    {
        "year": "7.000TCN - 5.000 TCN",
        "title": "Văn hóa Cái Bèo",
        "content": "Văn hóa Cái Bèo có niên đại trước nền văn hóa Hạ Long. Di chỉ Cái Bèo được phát hiện vào năm 1938 trong lần tiến hành thám sát khảo cổ học ven biển khu vực liên quan thuộc vùng vịnh Hạ Long ngày nay. ",
        "thoiky": "tiensu"
    },
    {
        "year": "6.000TCN - 5.000 TCN",
        "title": "Văn hóa Đa bút",
        "content": "Văn hóa Đa Bút là một nền văn hóa Việt Nam ở sơ kỳ thời đại đồ đá mới có niên đại sau các nền văn hóa Hòa Bình và Bắc Sơn, cách đây từ 5000 đến 6000 năm. Tính đến năm 2010, đã có hơn 10 điểm văn hóa Đa Bút được phát hiện và khai quật. Các bộ lạc chủ nhân của văn hóa Đa Bút đã tạo ra nền văn hóa Đông Sơn.",
        "thoiky": "tiensu"
    },
    {
        "year": "3.000TCN - 1.500 TCN",
        "title": "Văn hóa Hạ Long",
        "content": "Văn hóa Hạ Long là một nền văn hóa cổ. Cho đến nay, đã có khoảng gần 50 di tích “Văn hoá Hạ Long” được phát hiện trên các đảo của Vịnh Hạ Long cũng như dọc bờ biển từ Móng Cái đến Vân Đồn, với đặc trưng chung về loại hình - kỹ thuật chế tác công cụ đá và đồ gốm có từ cách đây 5.000-3.000 năm.",
        "thoiky": "tiensu"
    },
    {
        "year": "2.000TCN - 1.500 TCN",
        "title": "Văn hóa Phùng Nguyên",
        "content": "Văn hóa Phùng Nguyên là một nền văn hóa tiền sử thuộc sơ kỳ thời đại đồ đồng, cuối thời đại đồ đá mới. Tính đến năm 1998, có khoảng 55 địa điểm đã được phát hiện có di chỉ văn hóa đồng dạng với các di chỉ tại Phùng Nguyên, trong đó có 3 địa điểm có di cốt người. Công cụ bằng đá phổ biến và chiếm ưu thế tuyệt đối. Đồ trang sức bằng các loại đá, đá bán quý, ngọc được tìm thấy nhiều, đặc biệt là các vòng đá. ",
        "thoiky": "tiensu"
    },
    {
        "year": "2.000TCN - 1.000 TCN",
        "title": "Văn hóa Tiền Sa Huỳnh",
        "content": "Hiện nay chưa có những thông tin chính thức về nền văn hóa cổ xưa này",
        "thoiky": "tiensu"
    },
    {
        "year": "1.500TCN - 1.000 TCN",
        "title": "Văn hóa Đồng Đậu",
        "content": "Văn hoá Đồng Đậu là nền văn hóa thuộc thời kỳ đồ đồng ở Việt Nam cách ngày nay khoảng 3.000 năm, sau văn hóa Phùng Nguyên, trước văn hóa Gò Mun. Tên của nền văn hóa này đặt theo tên khu di tích Đồng Đậu ở thị trấn Yên Lạc, huyện Yên Lạc, tỉnh Vĩnh Phúc, nơi các nhà khảo cổ học đã khám phá ra một nền văn hóa đồ đồng phong phú năm 1962.",
        "thoiky": "tiensu"
    },
    {
        "year": "1.000TCN - 600 TCN",
        "title": "Văn hóa Gò Mun",
        "content": "Văn hóa Gò Mun được đặt tên theo địa điểm (gò Mun, xã Tứ Xã, huyện Phong Châu, tỉnh Phú Thọ), vào năm 1961 các nhà khảo cổ học đã khai quật được nhiều di chỉ của nền văn hóa này.Văn hóa Gò Mun được nhìn nhận như là nền văn hóa tiền văn hóa Đông Sơn. Thời kỳ này, người Việt cổ đã có những chuyển biến rõ rệt về một xã hội phức tạp và giàu có, thúc đẩy việc ra đời nhà nước sơ khai của người Việt.",
        "thoiky": "tiensu"
    },
    {
        "year": "1.000TCN - 200 TCN",
        "title": "Văn hóa Sa Huỳnh",
        "content": "Văn hóa Sa Huỳnh là một nền văn hóa khảo cổ được xác định ở vào khoảng năm 1000 TCN đến cuối thế kỷ thứ 2. Nền văn hóa Sa Huỳnh là một trong ba cái nôi cổ xưa về văn minh trên lãnh thổ Việt Nam, cùng với Văn hóa Đông Sơn và Văn hóa. Sa Huỳnh đư­ợc nhà khảo cổ ng­ười Pháp M. Vinet phát hiện lần đầu tiên vào năm 1909. Nền văn hóa này còn được gọi là VH Kho Chum Sa Huỳnh",
        "thoiky": "tiensu"
    },
    {
        "year": "1.000TCN - 0",
        "title": "Văn hóa Đồng Nai",
        "content": "Văn hóa Đồng Nai chỉ các di tích khảo cổ ở Việt Nam phân bố trên vùng trung du và đồng bằng miền Đông Nam Bộ, ven các sông Đồng Nai, sông Sài Gòn và sông Vàm Cỏ, thể hiện một quá trình diễn biến văn hoá từ sơ kì thời đại đồ đồng đến sơ kì thời đại sắt.",
        "thoiky": "tiensu"
    },
    {
        "year": "700TCN - 100 TCN",
        "title": "Văn hóa Đông Sơn",
        "content": "Văn hóa Đông Sơn là một nền văn hóa cổ đã xuất hiện vào khoảng năm 800 Trước Công Nguyên, từng tồn tại ở một số tỉnh miền Bắc Việt Nam và Bắc Trung bộ Việt Nam,phân bố dọc theo các con sông chính: sông Hồng, sông Mã và sông Lam vào thời kỳ đồ đồng và thời kỳ đồ sắt sớm. Nền văn hóa này được đặt tên theo địa phương nơi các dấu tích đầu tiên của nó được phát hiện, gần sông Mã, Thanh Hóa. Có những nghiên cứu cho rằng trên cơ sở văn hóa Đông Sơn, nhà nước văn minh đầu tiên của người Việt, nhà nước Văn Lang của các Vua Hùng và nối tiếp là nhà nước Âu Lạc của An Dương Vương đã phát triển, trước khi bị ảnh hưởng của nền văn minh Hán. Theo đánh giá của các nhà khoa học, thì nền Văn hóa Đông Sơn là sự phát triển liên tục và kế thừa từ các thời kỳ tiền Đông Sơn trước đó là Văn hóa Phùng Nguyên đến Văn hóa Đồng Đậu và Văn hóa Gò Mun.",
        "thoiky": "tiensu"
    },
    {
        "year": "1TCN - 630",
        "title": "Văn hóa Óc Eo",
        "content": "Văn hóa Óc Eo là một nền văn hóa cổ hình thành và phát triển ở Nam Bộ Việt Nam từ thế kỷ 1 đến thế kỷ 7 sau Công Nguyên. Đây là một nền văn hóa lớn trong lịch sử Việt Nam, gắn liền với đất nước, con người ở vùng châu thổ hạ lưu sông Mê Kông và có quan hệ mật thiết với lịch sử Đông Nam Á cổ đại. Óc Eo vốn là tên một gò đất trên cánh đồng phía đông nam núi Ba Thê (nay thuộc thị trấn Óc Eo, huyện Thoại Sơn, tỉnh An Giang), là nơi đầu tiên tìm thấy những di chỉ quan trọng của nền văn minh này vào năm 1944",
        "thoiky": "tiensu"
    },
    {
        "year": "Thế kỷ 7 TCN - Thế kỷ 3 TCN",
        "title": "Nhà nước Văn Lang",
        "content": "Sự kiện Vua Hùng thành lập nước Văn Lang đánh dấu một bước ngoặt quan trọng trong lịch sử dân tộc Việt Nam. Vào khoảng thế kỷ thứ 7 TCN, Vua Hùng, vị vua đầu tiên của dân tộc, đã thống nhất các bộ tộc ở khu vực đồng bằng sông Hồng, lập nên nhà nước Văn Lang - nhà nước sơ khai đầu tiên của người Việt. Đây là cột mốc quan trọng trong việc hình thành bản sắc văn hóa và truyền thống của dân tộc ta, mở đầu cho thời kỳ dựng nước và giữ nước kéo dài hàng ngàn năm. Kinh đô được đặt ở Phong Châu (ngày nay là Phú Thọ). Xã hội Văn Lang được tổ chức theo mô hình liên minh bộ lạc, với chế độ mẫu hệ và tôn giáo sơ khai.",
        "thoiky": "sosu"
    },
    {
        "year": " 207 TCN",
        "title": "Nhà nước Âu Lạc",
        "content": "An Dương Vương thôn tính Văn Lang, thành lập quốc gia Âu Lạc. Âu Lạc được thành lập bởi An Dương Vương (Thục Phán) vào thế kỷ 3 TCN sau khi ông hợp nhất các bộ tộc Lạc Việt (nhà nước Văn Lang) và bộ tộc Âu Việt. Thành tựu nổi bật của thời kỳ Âu Lạc là việc xây dựng thành Cổ Loa (Hà Nội ngày nay), một công trình kiến trúc quân sự quan trọng để chống lại các cuộc xâm lược từ bên ngoài. Năm 179 TCN, nhà nước Âu Lạc bị quân Nam Việt do Triệu Đà chỉ huy đánh bại, kết thúc thời kỳ độc lập đầu tiên của Việt Nam.",
        "thoiky": "sosu"
    },
    {
        "year": "218TCN - 207TCN",
        "title": "Chiến tranh Tần-Việt",
        "content": "Chiến tranh Tần – Việt là cuộc kháng chiến chống nhà Tần mở rộng về phía nam của các bộ tộc Bách Việt ở vùng Hoa Nam, đây là các tộc người phân bố ở miền nam Trung hoa và Bắc Bộ Việt Nam hiện nay. Chiến dịch diễn ra 221 trước công nguyên (TCN) đến năm 214 TCN, nghĩa là nhà Tần thực hiện mở rộng lãnh thổ về phía nam ngay sau khi thống nhất Trung Quốc.",
        "thoiky": "sosu"
    },
    {
        "year": "179 TCN",
        "title": "Triệu Đà xâm lược nước Âu Lạc, sáp nhập vào quốc gia Nam Việt",
        "content": "Năm 179 TCN, Triệu Đà sáp nhập đất đai Âu Lạc vào Nam Việt, chia Âu Lạc thành hai quận là Giao Chỉ và Cửu Chân.",
        "thoiky": "bacthuoc"
    },
    {
        "year": "111 TCN",
        "title": "Chiến tranh Hán-Nam Việt",
        "content": "Chiến tranh Hán – Nam Việt là một cuộc chiến tranh giữa Nhà Hán (còn gọi là Nhà Tây Hán) và nước Nam Việt thời Nhà Triệu vào cuối thế kỷ 2 trước Công nguyên.",
        "thoiky": "bacthuoc"
    },
    {
        "year": "40",
        "title": "khởi nghĩa Hai Bà Trưng",
        "content": "Khởi nghĩa Hai Bà Trưng là cuộc khởi nghĩa chống Bắc thuộc đầu tiên trong lịch sử Việt Nam do hai chị em Trưng Trắc và Trưng Nhị lãnh đạo. Cuộc khởi nghĩa đã đánh đuổi được lực lượng cai trị nhà Đông Hán ra khỏi Giao Chỉ (tương đương một phần Quảng Tây, Trung Quốc và Bắc Bộ, Bắc Trung Bộ Việt Nam hiện nay), mang lại độc lập trong 3 năm cho người Việt tại đây.",
        "thoiky": "bacthuoc"
    },
    {
        "year": "42-43",
        "title": "Chiến tranh Lĩnh Nam - Đông Hán",
        "content": "Chiến tranh Hán-Việt 42-43 là tên gọi của cuộc chiến do tướng nhà Đông Hán Mã Viện chỉ huy chống lại quân nổi dậy của Hai Bà Trưng ở đất Việt năm 42-43.",
        "thoiky": "bacthuoc"
    },
    {
        "year": "156–160",
        "title": "Khởi nghĩa Chu Đạt",
        "content": "Cuộc khởi nghĩa Chu Đạt diễn ra từ năm 156 đến năm 160. Năm 156, Chu Đạt, người huyện Cư Phong, Cửu Chân (nay là xã Phú Hào-Thọ Phú, huyện Triệu Sơn, Thanh Hóa), nổi dậy chống chính quyền đô hộ nhà Đông Hán. ",
        "thoiky": "bacthuoc"
    },
    {
        "year": "178–181",
        "title": "Khởi nghĩa Lương Long",
        "content": "Khởi nghĩa Lương Long (178-181) do Lương Long (梁龍) người Giao Chỉ lãnh đạo nhân dân các quận Giao Chỉ, Cửu Chân, Nhật Nam, Hợp Phố chống lại chính quyền đô hộ nhà Đông Hán.",
        "thoiky": "bacthuoc"
    },
    {
        "year": "192",
        "title": "Khu Liên khởi nghĩa",
        "content": "Khu Liên khởi nghĩa, tách quận Nhật Nam thành lập quốc gia Lâm Ấp",
        "thoiky": "bacthuoc"
    },
    {
        "year": "229",
        "title": "lập nước Đông Ngô",
        "content": "23 tháng 6 năm 229 Tôn Quyền xưng đế, lập nước Đông Ngô, ly khai nhà Hán",
        "thoiky": "bacthuoc"
    },
    {
        "year": "246 - 248",
        "title": "Khởi nghĩa Bà Triệu",
        "content": "Cuộc khởi nghĩa của bà và Triệu Quốc Đạt bùng nổ vào nǎm 248 và được nhân dân trong quận Cửu Chân hưởng ứng nhiệt liệt và nhanh chóng lan tỏa ra quận Giao Chỉ. Bà làm hịch truyền đi khắp nơi, kể tội nhà Ngô và kêu gọi mọi người đứng dậy đánh đuổi quân Ngô. Từ núi rừng Ngàn Nưa, nghĩa quân Bà Triệu tấn công thành Tư Phố và đã mau chóng giành thắng lợi trọn vẹn. Bà Triệu cùng nghĩa quân vượt sông Mã xuống vùng Bồ Điền để xây dựng căn cứ địa. ",
        "thoiky": "bacthuoc"
    },
    {
        "year": "280",
        "title": "Chiến tranh Tấn – Ngô",
        "content": "Chiến tranh Tấn-Ngô 279-280 là cuộc chiến cuối cùng thời Tam Quốc trong lịch sử Trung Quốc. Vua Tây Tấn là Tư Mã Viêm phát động chiến tranh và nhanh chóng tiêu diệt nước Đông Ngô (được hình thành từ đầu thế kỷ 3) chỉ sau một chiến dịch. Cuộc chiến tranh này gắn liền với sự kiện nhà Tây Tấn thống nhất toàn quốc, thời Tam Quốc kết thúc.",
        "thoiky": "bacthuoc"
    },
    {
        "year": "420",
        "title": "lập ra nhà Lưu Tống",
        "content": "Lưu Dụ ép Tấn Cung Đế nhường ngôi, lập ra nhà Lưu Tống",
        "thoiky": "bacthuoc"
    },
    {
        "year": "468 - 485",
        "title": "khởi nghĩa Lý Trường Nhân",
        "content": "Lý Trường Nhân (chữ Hán: 李長仁, 440 - 478) là một thủ lĩnh địa phương, cát cứ Giao Châu, tự trị với chính quyền phong kiến phương Bắc trong lịch sử Việt Nam thời Bắc thuộc lần II.",
        "thoiky": "bacthuoc"
    },
    {
        "year": "479",
        "title": "thành lập nhà Nam Tề",
        "content": "479 Tiêu Đạo Thành phế Lưu Chuẩn tự làm vua, thành lập nhà Nam Tề",
        "thoiky": "bacthuoc"
    },
    {
        "year": "502",
        "title": "thành lập nhà Lương",
        "content": "Tiêu Diễn phế truất Tiêu Bảo Dung, thành lập nhà Lương",
        "thoiky": "bacthuoc"
    },
    {
        "year": "541",
        "title": "khởi nghĩa Lý Bí",
        "content": "Chiến tranh Tiền Lý - Lương là cuộc chiến bùng nổ từ năm 545 đến năm 550 kéo dài 5 năm do Triệu Quang Phục lãnh đạo chống quân Lương.",
        "thoiky": "bacthuoc"
    },
    {
        "year": "544",
        "title": "Lý Bí thành lập quốc gia Vạn Xuân",
        "content": "Tháng 2 năm 544, sau khi đánh bại quân nhà Lương, Lý Bí xưng là Hoàng đế và đặt tên nước là Vạn Xuân, đóng đô ở Ô Diên thành,Hạ Mỗ, huyện Đan Phượng, Hà Nội ngày nay.",
        "thoiky": "bacthuoc"
    },
    {
        "year": "602",
        "title": "Chiến tranh Tùy–Vạn Xuân",
        "content": "Chiến tranh Tùy–Vạn Xuân là một cuộc xung đột quân sự giữa nhà Tùy của Trung Quốc và nhà Tiền Lý quốc hiệu Vạn Xuân của Việt Nam vào năm 602.",
        "thoiky": "bacthuoc"
    },
    {
        "year": "687",
        "title": "khởi nghĩa Lý Tự Tiên",
        "content": "Lý Tự Tiên là người ở Giao Châu, bị Nhà Đường đô hộ từ năm 618 đến năm 905. Năm 679, nhà Đường lập ra An Nam đô hộ phủ, sử phương Bắc bắt đầu gọi Việt Nam là An Nam kể từ đó.",
        "thoiky": "bacthuoc"
    },
    {
        "year": "713 - 723",
        "title": "khởi nghĩa Mai Hắc Đế",
        "content": "Năm 722, khởi nghĩa bùng nổ. Kết quả: Mai Hắc Đế thua trận",
        "thoiky": "bacthuoc"
    },
    {
        "year": "776-791",
        "title": "khởi nghĩa Phùng Hưng",
        "content": "Giành quyền làm chủ trong 9 năm nhưng sau đó bị đàn áp.",
        "thoiky": "bacthuoc"
    },
    {
        "year": "905",
        "title": "Khúc Thừa Dụ xây dựng chính quyền tự chủ",
        "content": "Khúc Thừa Dụ ( 830 – 907) được suy tôn là Khúc Tiên Chủ, là tiết độ sứ người bản địa đầu tiên của Tĩnh Hải quân, đồng thời là người đặt cơ sở cho nền độc lập của dân tộc Việt sau hơn 1.000 năm thuộc Trung Quốc.",
        "thoiky": "quanchu"
    },
    {
        "year": "938 ",
        "title": "Ngô Quyền đánh bại quân Nam Hán trên sông Bạch Đằng",
        "content": "Trận sông Bạch Đằng năm 938 là một trận đánh giữa quân dân Tĩnh Hải quân (vào thời đó, Việt Nam chưa có quốc hiệu chính thức) do Ngô Quyền lãnh đạo đánh với quân Nam Hán trên sông Bạch Đằng. Kết quả là người Việt giành thắng lợi lớn nhờ kế sách cắm cọc nhọn dưới lòng sông Bạch Đằng của Ngô Quyền. Trước sự chiến đấu dũng mãnh của người Việt, quá nửa quân Nam Hán chết đuối, hoàng tử Nam Hán là Lưu Hoằng Tháo cũng tử trận, Đây là một trận đánh quan trọng trong lịch sử Việt Nam. Nó đánh dấu cho việc chấm dứt hơn 1000 năm Bắc thuộc của Việt Nam, nối lại quốc thống cho người Việt.",
        "thoiky": "quanchu"
    },
    {
        "year": "939",
        "title": "Ngô Quyền xưng vương, kinh đô Cổ Loa",
        "content": "Sau chiến thắng trận sông Bạch Đằng, Ngô Quyền lên ngôi vua, tái lập đất nước.",
        "thoiky": "quanchu"
    },
    {
        "year": "944 - 968",
        "title": "Loạn 12 sứ quân",
        "content": "Loạn 12 sứ quân là một giai đoạn nội chiến diễn ra vào cuối thời nhà Ngô, kéo dài từ năm 944 sau khi Ngô Quyền mất cho đến khi Đinh Bộ Lĩnh thống nhất đất nước, lập ra nhà Đinh năm 968, được ghi chép trong phần Bản kỷ Ngô sứ quân Ngô Xương Xí.",
        "thoiky": "quanchu"
    },
    {
        "year": "968",
        "title": "Đinh Bộ Lĩnh xưng đế, thành lập quốc gia Đại Cồ Việt, kinh đô Hoa Lư",
        "content": "Đại Cồ Việt là nhà nước mở đầu cho thời đại độc lập, tự chủ, xây dựng chế độ quân chủ tập quyền ở Việt Nam. Đinh Bộ Lĩnh mở nước, lập đô, lấy niên hiệu với tư cách người đứng đầu một vương triều bề thế: Thời kỳ phục quốc của Việt Nam, từ họ Khúc chỉ xưng làm Tiết độ sứ, tới Ngô Quyền xưng vương và tới vua Đinh xưng làm hoàng đế. ",
        "thoiky": "quanchu"
    },
    {
        "year": "970",
        "title": "Đồng tiền đầu tiên của Việt Nam",
        "content": "Thái Bình hưng bảo là tên gọi đồng tiền đầu tiên của Việt Nam do nhà Đinh là một triều đại của người Việt cho đúc bắt đầu từ năm 970. Đây được xác định là đồng tiền xưa nhất do người Việt phát hành. Tiền Thái Bình hưng bảo ra đời góp phần khẳng định nền độc lập tự chủ của dân tộc Việt Nam trên các lĩnh vực kinh tế, chính trị, ngoại giao, văn hóa mà Đinh Tiên Hoàng đã xác lập",
        "thoiky": "quanchu"
    },
    {
        "year": "979",
        "title": "Đinh Bộ Lĩnh cùng con trai bị sát hại",
        "content": "Năm 979, Đinh Bộ Lĩnh, vị vua sáng lập ra nhà Đinh, cùng con trai Đinh Liễn đã bị ám sát trong một sự kiện gây chấn động thời bấy giờ. Đây là một dấu mốc quan trọng trong lịch sử Việt Nam vì nó đã dẫn. Vụ ám sát năm 979 không chỉ đánh dấu sự kết thúc của triều đại Đinh mà còn mở ra một thời kỳ chuyển tiếp quan trọng trong lịch sử Việt Nam.",
        "thoiky": "quanchu"
    },
    {
        "year": "980",
        "title": "Lê Hoàn lên ngôi vua, thành lập nhà Tiền Lê",
        "content": "Năm 980, nhà Tống rục rịch điều quân sang đánh Đại Cồ Việt, Thái hậu Dương Vân Nga cùng triều thần tôn Lê Hoàn lên làm vua, tức vua Lê Đại Hành. Nhà Đinh kết thúc, truyền được đến đời thứ hai, trị vì 12 năm (968-980). Lê Hoàn sau khi lên ngôi lập ra nhà Tiền Lê",
        "thoiky": "quanchu"
    },
    {
        "year": "981",
        "title": "Chiến tranh Tống - Việt",
        "content": "Chiến tranh Tống-Việt là một cuộc chiến tranh giữa Nhà Tống thời Tống Thái Tông và Đại Cồ Việt thời Lê Đại Hành diễn ra từ tháng 1 đến tháng 4 năm 981 trên lãnh thổ Đại Cồ Việt. Kết quả, Đại Cồ Việt đã đánh bại quân đội nhà Tống. Sau cuộc chiến này, vào năm 986, Hoàng đế Đại Tống công nhận nhà Tiền Lê và ban chế phong cho Lê Đại Hành.",
        "thoiky": "quanchu"
    },
    {
        "year": "1009",
        "title": "thành lập nhà Lý",
        "content": "21 tháng 11 Lý Công Uẩn lên ngôi vua, thành lập nhà Lý",
        "thoiky": "quanchu"
    },
    {
        "year": "1010",
        "title": "Lý Công Uẩn dời đô về Thăng Long",
        "content": "Thời gian trị vì của Lý Công Uẩn chủ yếu để đàn áp các cuộc nổi dậy, vì lòng dân chưa phục được nhà Lý. Khi lòng dân đã yên, triều đình trung ương được củng cố, ông dời đô từ Hoa Lư về Đại La vào năm 1010, đổi tên thành Thăng Long, mở đầu cho sự phát triển lâu dài của nhà Lý tồn tại 216 năm.",
        "thoiky": "quanchu"
    },
    {
        "year": "1054",
        "title": "đổi tên nước từ Đại Cồ Việt thành Đại Việt",
        "content": "Lý Thánh Tông lên ngôi, đổi tên nước từ Đại Cồ Việt thành Đại Việt",
        "thoiky": "quanchu"
    },
    {
        "year": "1075–1077",
        "title": "Chiến tranh Tống-Việt",
        "content": "Chiến tranh Tống–Việt lần thứ hai diễn ra từ năm 1075 đến năm 1077 là cuộc chiến tranh giữa nhà Lý nước Đại Việt và nhà Tống của Trung Quốc. Giai đoạn đầu, trong các năm 1075-1076, tướng nhà Lý là Lý Thường Kiệt đã chủ động đánh phủ đầu sang đất Tống với 10 vạn quân, phá thành Ung Châu.Giai đoạn sau, trong các năm 1076-1077, quân Lý rút về phòng thủ chống lại cuộc phản công của đại quân Tống do Quách Quỳ chỉ huy với 300.000 người, gồm binh lính và dân phu. Cuộc chiến rơi vào bế tắc, cuối cùng hai bên đàm phán, quân Tống rút ra khỏi lãnh thổ Đại Việt.",
        "thoiky": "quanchu"
    },
    {
        "year": "1077",
        "title": "đẩy lùi quân xâm lược Tống",
        "content": "18 tháng 1 – 28 tháng 2 Trận Như Nguyệt, đẩy lùi quân xâm lược Tống.Trận Như Nguyệt là một trận đánh lớn diễn ra ở một khúc sông Như Nguyệt (hay sông Cầu) vào năm 1077, là trận đánh có tính quyết định của cuộc Chiến tranh Tống-Việt, 1075-1077, và là trận đánh cuối cùng của nhà Tống trên đất Đại Việt. Trận chiến diễn ra trong nhiều tháng, kết thúc bằng chiến thắng của quân đội Đại Việt và thiệt hại nhân mạng lớn của quân Tống, đánh bại hoàn toàn ý chí xâm lược Đại Việt của họ, buộc họ phải thừa nhận Đại Việt là một quốc gia",
        "thoiky": "quanchu"
    },
    {
        "year": "1226",
        "title": "thành lập nhà Trần",
        "content": "10 tháng 1 Lý Chiêu Hoàng nhường ngôi cho Trần Cảnh, thành lập nhà Trần",
        "thoiky": "quanchu"
    },
    {
        "year": "1258",
        "title": "Chiến tranh Nguyên Mông–Đại Việt lần 1",
        "content": "Chiến tranh Mông Nguyên – Đại Việt lần thứ nhất hay Kháng chiến chống Mông Nguyên lần thứ nhất là cách người Việt Nam gọi cuộc chiến đấu của quân dân Đại Việt chống lại quân đội của đế quốc Mông Cổ do Uriyangqatai (Ngột Lương Hợp Thai) chỉ huy vào trong khoảng thời gian nửa tháng cuối tháng 1 năm 1258 hay năm Nguyên Phong thứ 7.",
        "thoiky": "quanchu"
    },
    {
        "year": "1282",
        "title": "Hội nghị Bình Than, triệu họp vương hầu, trăm quan",
        "content": "Hội nghị Bình Than là một hội nghị quân sự do vua Trần Nhân Tông triệu tập vào tháng 10 năm 1282 để bàn phương hướng kháng chiến khi quân Mông Nguyên sang xâm lược Đại Việt lần thứ hai. Đây là hội nghị của những người nắm giữ trọng trách lãnh đạo sự nghiệp giữ nước và chỉ bàn hai vấn đề thiết yếu nhất: đó là xác định phương hướng chiến lược chống xâm lăng và tổ chức bộ máy chỉ huy chống xâm lăng. Ở hội nghị Bình Than, vua Trần Nhân Tông và Thượng hoàng Trần Thánh Tông đã quyết định trao quyền Tổng chỉ huy quân đội cho Trần Quốc Tuấn; Nhân Huệ vương Trần Khánh Dư làm Phó đô tướng quân.",
        "thoiky": "quanchu"
    },
    {
        "year": "1284",
        "title": "Hội nghị Diên Hồng",
        "content": "Hội nghị Diên Hồng là hội nghị được tổ chức năm 1284 tại kinh thành Thăng Long do Thượng hoàng Trần Thánh Tông triệu họp các bô lão trong cả nước về trước thềm điện Diên Hồng để trưng cầu dân ý, hỏi về chủ trương hòa hay đánh khi quân Nguyên Mông sang xâm lược Việt Nam lần thứ 2.",
        "thoiky": "quanchu"
    },
    {
        "year": "1285",
        "title": "Chiến tranh Nguyên Mông-Đại Việt lần 2",
        "content": "Chiến tranh Nguyên Mông – Đại Việt lần 2 là cuộc chiến tranh giữa Đại Nguyên và Đại Việt diễn ra trên lãnh thổ Đại Việt từ cuối tháng 1 đến cuối tháng 5 năm 1285 (dương lịch). Cuộc chiến tranh lần này diễn ra sau cuộc chiến giữa hai nước lần thứ nhất khoảng 27 năm. Trong lần này, quân Nguyên huy động lực lượng đông đảo gấp hàng chục lần so với cuộc chiến lần trước. Nhưng dù cho quân Nguyên Mông hùng mạnh và có một số Vương hầu của triều Trần mang tư tưởng đầu hàng, quân dân Đại Việt dưới sự lãnh đạo của Trần Hưng Đạo, Thái thượng hoàng Trần Thánh Tông và nhà vua Trần Nhân Tông đã giành chiến thắng vang dội trong cuộc kháng chiến này, thể hiện 'Hào khí Đông A' của nước Đại Việt thời đó.",
        "thoiky": "quanchu"
    },
    {
        "year": "1287–1288",
        "title": "Chiến tranh Nguyên Mông–Đại Việt lần 3",
        "content": "Chiến tranh Nguyên Mông – Đại Việt lần 3 (theo cách gọi khác ở Việt Nam là Kháng chiến chống quân Nguyên Mông lần thứ 3) là cuộc chiến tranh giữa Đại Nguyên và Đại Việt diễn ra trên lãnh thổ Đại Việt từ tháng 12 năm 1287 đến cuối tháng 4 năm 1288. Đại Việt lại một lần nữa đẩy lui được cuộc xâm lăng của Nguyên Mông. Sau này, giữa nhà Trần và nhà Nguyên không phát sinh thêm cuộc chiến tranh nào và đây được sử sách nhìn nhận là cuộc chiến cuối cùng giữa hai bên.",
        "thoiky": "quanchu"
    },
    {
        "year": "1400-1407",
        "title": "Chiến tranh Việt-Chiêm",
        "content": "Chiến tranh Việt – Chiêm (1400–1407) là cuộc chiến giữa nhà Hồ nước Đại Ngu và nước Chiêm Thành phía nam. Ban đầu nhà Hồ chiếm được đất đai mà tương đương với nam Quảng Nam và bắc Quảng Ngãi ngày nay; nhưng sau đó, do cuộc xâm lăng của nhà Minh, nhà Hồ thất bại và Chiêm Thành đã lấy lại những đất đai từng bị nhà Hồ chiếm.",
        "thoiky": "quanchu"
    },
    {
        "year": "1406-1407",
        "title": "Chiến tranh Đại Ngu–Đại Minh",
        "content": "Chiến tranh Đại Ngu – Đại Minh, Chiến tranh Hồ – Minh, hay thường được giới sử học Việt Nam gọi là cuộc xâm lược của nhà Minh, là cuộc chiến của nhà Hồ nước Đại Ngu (Đại Việt) chống lại cuộc xâm lược của nhà Minh (Trung Quốc) dưới triều Minh Thành Tổ từ tháng 4 năm 1406 cho đến tháng 6 năm 1407 khi nhà Minh đánh bại hoàn toàn quân đội nhà Hồ và bắt được Hồ Quý Ly, Hồ Hán Thương.",
        "thoiky": "quanchu"
    },
    {
        "year": "1418-1427",
        "title": "Khởi nghĩa Lam Sơn",
        "content": "Khởi nghĩa Lam Sơn là một cuộc khởi nghĩa của người Việt do Lê Lợi lãnh đạo chống lại sự cai trị của nhà Minh, bắt đầu từ đầu năm 1418 và kết thúc với thắng lợi của Nghĩa quân Lam Sơn cùng sự rút lui về nước của quân Minh sau Hội thề Đông Quan cuối năm 1427.",
        "thoiky": "quanchu"
    },
    {
        "year": "1428",
        "title": "Lê Lợi thành lập quốc gia Đại Việt,",
        "content": "29 tháng 4 Lê Lợi thành lập quốc gia Đại Việt, đặt kinh đô tại Đông Kinh",
        "thoiky": "quanchu"
    },
    {
        "year": "1442",
        "title": "Vụ án Lệ Chi viên",
        "content": "Vụ án Lệ Chi viên, tức Vụ án vườn vải, là một vụ án oan nổi tiếng thời Lê sơ. Qua vụ án này, quan Đại thần Hành khiển Nguyễn Trãi và vợ là Lễ nghi học sĩ Nguyễn Thị Lộ bị triều đình Lê Sơ kết tội giết vua Lê Thái Tông, bắt tội chém đầu đến 3 họ nhà Nguyễn Trãi.",
        "thoiky": "quanchu"
    },
    {
        "year": "1459-1460",
        "title": "Chính biến Thiên Hưng",
        "content": "Lê Thánh Tông lên ngôi",
        "thoiky": "quanchu"
    },
    {
        "year": "1471",
        "title": "Chiên tranh Việt-Chiêm",
        "content": "1471 Chiến tranh Việt–Chiêm, miền bắc Chiêm Thành sáp nhập vào Đại Việt",
        "thoiky": "quanchu"
    },
    {
        "year": "1478–1480",
        "title": "Chiến tranh Đại Việt–Lan Xang",
        "content": "Chiến tranh Đại Việt – Lan Xang là cuộc chiến giữa nhà Hậu Lê nước Đại Việt với Lan Xang (Lào). Mục đích phát động của Đại Việt là bình định vương quốc Bồn Man và ngăn chặn sự quấy nhiễu của quân Lan Xang tại biên giới phía tây.",
        "thoiky": "quanchu"
    },
    {
        "year": "1483",
        "title": "Luật Hồng Đức",
        "content": "",
        "thoiky": "quanchu"
    },
    {
        "year": "1516-1526",
        "title": "Khủng hoảng cuối nhà Lê sơ và nội chiến",
        "content": "Trong lịch sử Việt Nam, giai đoạn cuối triều Lê sơ (1516 – 1526) tương ứng với các triều vua Lê Tương Dực, Lê Chiêu Tông và Lê Cung Hoàng xảy ra khủng hoảng kinh tế - chính trị trầm trọng. Trong khoảng thời gian này, Đại Việt trở nên loạn lạc, biến thành nội chiến kéo dài khiến nhà Lê suy vong, cuối cùng dẫn đến Mạc Đăng Dung nắm quyền, lập nên nhà Mạc.",
        "thoiky": "quanchu"
    },
    {
        "year": "1527",
        "title": "Nhà Mạc Thành Lập",
        "content": "Mạc Đăng Dung ép Lê Cung Hoàng nhường ngôi, lập lên nhà Mạc",
        "thoiky": "quanchu"
    },
    {
        "year": "1533-1677",
        "title": "Chiến tranh Lê-Mạc",
        "content": "Nội chiến Lê – Mạc (1533–1677) là cuộc nội chiến giữa nhà Mạc và nhà Hậu Lê trong lịch sử Việt Nam. Phe chống nhà Mạc về sau khi chép sử có gọi đây là thời kỳ Phù Lê diệt Mạc.",
        "thoiky": "quanchu"
    },
    {
        "year": "1771",
        "title": "khởi nghĩa Tây Sơn",
        "content": "Nhà Tây Sơn (chữ Nôm: 家西山, chữ Hán: 西山朝 / Tây Sơn triều) là một triều đại quân chủ trong lịch sử Việt Nam tồn tại từ năm 1778 đến năm 1802, được thành lập trong bối cảnh tranh chấp quyền lực cuối thời Lê Trung hưng (1533–1789). ",
        "thoiky": "quanchu"
    },
    {
        "year": "1774–1775",
        "title": "chiến tranh Bình Nam",
        "content": "Bình Nam (Chữ Hán: 平南) là cuộc chiến lần thứ 8 và là cuộc chiến cuối cùng giữa chúa Trịnh và chúa Nguyễn trong lịch sử chia cắt Đàng Ngoài-Đàng Trong hơn 200 năm của nước Đại Việt.",
        "thoiky": "quanchu"
    },
    {
        "year": "1777",
        "title": "Nguyễn Ánh xưng vương",
        "content": "",
        "thoiky": "quanchu"
    },
    {
        "year": "1778",
        "title": "Nguyễn Nhạc xưng Hoàng đế",
        "content": "Nguyễn Nhạc xưng Hoàng đế, đặt niên hiệu Thái Đức, lập lên nhà Tây Sơn, đặt kinh đô tại Quy Nhơn. Nguyễn Nhạc phong Nguyễn Huệ làm Bắc Bình Vương",
        "thoiky": "quanchu"
    },
    {
        "year": "1788",
        "title": "Nguyễn Nhạc từ bỏ đế hiệu",
        "content": "Trịnh – Nguyễn phân tranh  là thời kỳ phân chia lãnh thổ giữa chế độ 'vua Lê chúa Trịnh' ở phía Bắc sông Gianh (Đàng Ngoài) và chúa Nguyễn cai trị ở miền Nam (Đàng Trong), mở đầu khi Trịnh Tráng đem quân đánh Nguyễn Phúc Nguyên năm 1627 và kết thúc vào năm 1777 khi chúa Nguyễn sụp đổ.",
        "thoiky": "quanchu"
    },
    {
        "year": "1789",
        "title": "Trận Ngọc Hồi – Đống Đa, đẩy lui quân xâm lược nhà Thanh, nhà Hậu Lê sụp đổ",
        "content": "Trận Ngọc Hồi – Đống Đa (hay Chiến thắng Kỷ Dậu) là tên gọi do các nhà sử học Việt Nam dành cho loạt trận đánh chống ngoại xâm thắng lợi của nước Đại Việt thời Tây Sơn do vua Quang Trung lãnh đạo vào đầu năm Kỷ Dậu 1789, đánh tan đội quân Mãn Thanh do Tôn Sĩ Nghị chỉ huy - kéo sang biên giới và tràn vào lãnh thổ Đại Việt do sự cầu viện của vua Lê Chiêu Thống nhà Hậu Lê.",
        "thoiky": "quanchu"
    },
    {
        "year": "1792",
        "title": "Nguyễn Huệ qua đời",
        "content": "16 tháng 9 Nguyễn Huệ qua đời, con trai Nguyễn Quang Toản lên ngôi",
        "thoiky": "quanchu"
    },
    {
        "year": "1802 ",
        "title": "Nhà Nguyễn thành lập",
        "content": "Nguyễn Ánh đánh bại nhà Tây Sơn, lên ngôi vua, đặt niên hiệu là Gia Long, lập lên nhà Nguyễn, đặt kinh đô tại Phú Xuân",
        "thoiky": "quanchu"
    },
    {
        "year": "1803–1855",
        "title": "Nổi dậy Đá Vách",
        "content": "Phong trào nổi dậy ở Đá Vách là tên gọi một loạt nhiều cuộc nổi dậy của người dân tộc thiểu số ở khu vực Quảng Ngãi, Việt Nam. Phong trào kéo dài từ buổi đầu triều đại vua Gia Long đến suốt hơn nửa thế kỷ",
        "thoiky": "quanchu"
    },
    {
        "year": "1804",
        "title": "Nguyễn Ánh đổi tên nước thành Việt Nam",
        "content": "",
        "thoiky": "quanchu"
    },
    {
        "year": "1821–1827",
        "title": "Khởi nghĩa Phan Bá Vành",
        "content": "Cuộc khởi nghĩa Phan Bá Vành (bắt đầu: 1821?, kết thúc: 1827) là cuộc khởi nghĩa nông dân kéo dài nhất, phạm vi ảnh hưởng rộng nhất do Phan Bá Vành lãnh đạo nhằm chống lại đường lối cai trị của nhà Nguyễn ở nửa đầu thế kỷ 19 trong lịch sử Việt Nam.",
        "thoiky": "quanchu"
    },
    {
        "year": "1833–1834",
        "title": "Chiến tranh Việt–Xiêm",
        "content": "Chiến tranh Việt – Xiêm (1833–1834) là một cuộc chiến gồm hai đợt tấn công của quân Xiêm vào lãnh thổ Việt Nam thời Nhà Nguyễn của vua Minh Mạng, đợt thứ nhất khởi đầu từ tháng 11 năm 1833, đợt thứ hai tấn công từ tháng Giêng năm Giáp Ngọ (1834), đến tháng Năm cùng năm thì kết thúc. Sau cùng, quân Việt chiến thắng",
        "thoiky": "quanchu"
    },
    {
        "year": "1836",
        "title": "Việt Nam thôn tính Chân Lạp",
        "content": "Việt Nam thôn tính Chân Lạp, đặt làm Trấn Tây Thành",
        "thoiky": "quanchu"
    },
    {
        "year": "1839",
        "title": "Minh Mạng đổi tên nước thành Đại Nam",
        "content": "",
        "thoiky": "quanchu"
    },
    {
        "year": "1858–1884",
        "title": "Chiến tranh Pháp-Đại Nam",
        "content": "Chiến tranh Pháp – Đại Nam hoặc chiến tranh Pháp – Việt, hay còn được gọi là Pháp xâm lược Đại Nam, là một cuộc chiến tranh giữa nhà Nguyễn của Đại Nam và Đệ Nhị Đế chế Pháp (về sau Đệ Tam Cộng hoà Pháp kế tục), diễn ra từ năm 1858 đến năm 1884.",
        "thoiky": "quanchu"
    },
    {
        "year": "1861–1865",
        "title": "Bạo loạn ven biển",
        "content": "Cuộc nổi dậy Tạ Văn Phụng, hay còn gọi là Cuộc bạo loạn ven biển hoặc Nạn giặc biển; là cuộc nổi dậy do Tạ Văn Phụng lãnh đạo chống lại triều đình nhà Nguyễn ở vùng ven biển Bắc Kỳ diễn ra từ năm 1861 đến năm 1865.",
        "thoiky": "quanchu"
    },
    {
        "year": "1866",
        "title": "Chính biến chày vôi",
        "content": "Cuộc nổi dậy Đoàn Hữu Trưng xảy ra vào ngày 16 tháng 9 năm 1866 do Đoàn Hữu Trưng khởi xướng, có thể gọi là cuộc đảo chính lần thứ ba dưới triều vua Tự Đức.",
        "thoiky": "quanchu"
    },
    {
        "year": "1867",
        "title": "nhà Nguyễn cắt Nam Kỳ lục tỉnh nhượng cho Pháp",
        "content": "",
        "thoiky": "quanchu"
    },
    {
        "year": "1884",
        "title": "Hòa ước Giáp Thân, kết thúc Chiến tranh Pháp–Đại Nam, triều đình nhà Nguyễn chấp nhận sự bảo hộ của Pháp",
        "content": "Chiến tranh Pháp – Đại Nam hoặc chiến tranh Pháp – Việt, hay còn được gọi là Pháp xâm lược Đại Nam, là một cuộc chiến tranh giữa nhà Nguyễn của Đại Nam và Đệ Nhị Đế chế Pháp (về sau Đệ Tam Cộng hoà Pháp kế tục), diễn ra từ năm 1858 đến năm 1884. Do sự yếu kém của nhà Nguyễn cùng với ưu thế công nghệ của Pháp, cuộc chiến kết thúc bằng thắng lợi của Pháp. Pháp xâm chiếm toàn bộ lãnh thổ Đại Nam và thiết lập bộ máy cai trị, bắt đầu thời kỳ Pháp thuộc trong lịch sử Việt Nam.",
        "thoiky": "phapthuoc"
    },
    {
        "year": "1885–1895",
        "title": "phong trào Cần Vương",
        "content": "Phong trào Cần Vương (Chữ Nôm: 風潮勤王) nổ ra vào cuối thế kỷ 19 do đại thần nhà Nguyễn là Tôn Thất Thuyết nhân danh vua Hàm Nghi đề xướng trước cuộc xâm lược của thực dân Pháp.",
        "thoiky": "phapthuoc"
    },
    {
        "year": "1887",
        "title": "thực dân Pháp thành lập Liên bang Đông Dương",
        "content": "17 tháng 10 thực dân Pháp thành lập Liên bang Đông Dương, gồm Bắc Kỳ, Trung Kỳ, Nam Kỳ và Campuchia, đặt thủ đô tại Sài Gòn",
        "thoiky": "phapthuoc"
    },
    {
        "year": "1893",
        "title": "3 tháng 10 sáp nhập Lào vào Liên bang Đông Dương",
        "content": "",
        "thoiky": "phapthuoc"
    },
    {
        "year": "1898",
        "title": "sáp nhập Quảng Châu Loan vào Liên bang Đông Dương",
        "content": "",
        "thoiky": "phapthuoc"
    },
    {
        "year": "1902",
        "title": "Liên bang Đông Dương dời thủ đô về Hà Nội",
        "content": "",
        "thoiky": "phapthuoc"
    },
    {
        "year": "1906–1908",
        "title": "phong trào Duy Tân",
        "content": "Phong trào Duy Tân chủ trương bất bạo động, khôi phục đất nước bằng con đường nâng cao dân trí, cải tổ xã hội về mọi mặt, trong đó có kinh tế, giáo dục và văn hoá, với các hoạt động thực tiễn như là mở mang kinh tế, lập các nhà buôn lớn để tự lực, mở trường dạy học hiện đại: dạy quốc ngữ, bỏ lối học khoa bảng từ chương, thêm khoa học và ngoại ngữ cũng như hướng đến nền chính trị dân chủ",
        "thoiky": "phapthuoc"
    },
    {
        "year": "1908",
        "title": "phong trào chống sưu thuế Trung Kỳ",
        "content": "",
        "thoiky": "phapthuoc"
    },
    {
        "year": "1914–1918",
        "title": "khoảng 100.000 người Việt bị ép sang châu Âu chiến đấu cho Pháp trong Chiến tranh thế giới thứ nhất",
        "content": "Chiến tranh thế giới thứ nhất, còn được gọi là Đại chiến thế giới lần thứ nhất, Đệ nhất Thế chiến hay Thế chiến I, là một cuộc chiến tranh thế giới bắt nguồn tại châu Âu từ ngày 28 tháng 7 năm 1914 đến ngày 11 tháng 11 năm 1918.",
        "thoiky": "phapthuoc"
    },
    {
        "year": "1917",
        "title": "khởi nghĩa Thái Nguyên",
        "content": "Khởi nghĩa Thái Nguyên hay Binh biến Thái Nguyên là tên gọi cuộc nổi dậy ở tỉnh lỵ Thái Nguyên vào năm 1917 do Trịnh Văn Cấn chỉ huy, chống lại chính quyền Bảo hộ của Pháp để giành độc lập cho người Việt.",
        "thoiky": "phapthuoc"
    },
    {
        "year": "1919",
        "title": "18 tháng 6 Nguyễn Ái Quốc gửi Yêu sách của nhân dân An Nam tới Hội nghị Hòa bình Versailles",
        "content": "",
        "thoiky": "phapthuoc"
    },
    {
        "year": "1930",
        "title": "3 tháng 2 hợp nhất ba tổ chức cộng sản thành Đảng Cộng sản Việt Nam",
        "content": "",
        "thoiky": "phapthuoc"
    },
    {
        "year": "1930–1931",
        "title": "phong trào Xô Viết Nghệ Tĩnh",
        "content": "Xô Viết Nghệ - Tĩnh là tên gọi chỉ phong trào đấu tranh của lực lượng công nhân và nông dân ở Nghệ An và Hà Tĩnh trong năm 1930-1931 chống lại đế quốc Pháp tại Việt Nam. Tên gọi Xô viết Nghệ Tĩnh xuất phát từ sự hình thành các 'xã bộ nông' mà những người cộng sản gọi là 'Xô viết'",
        "thoiky": "phapthuoc"
    },
    {
        "year": "1939",
        "title": "khoảng 20.000 thanh niên Việt Nam bị cưỡng bức phục vụ Pháp trong chiến tranh thế giới thứ hai",
        "content": "",
        "thoiky": "phapthuoc"
    },
    {
        "year": "1940",
        "title": "quân đội Nhật Bản tiến vào Đông Dương",
        "content": "30 tháng 8 quân đội Nhật Bản tiến vào Đông Dương. 25 tháng 9 chính phủ Pháp chấp nhận mọi yêu sách, chấp nhận việc chiếm đóng cùng giao quyền điều hành những căn cứ quân sự cho quân đội Nhật",
        "thoiky": "phapthuoc"
    },
    {
        "year": "1944",
        "title": "Việt Nam Tuyên truyền Giải phóng quân được thành lập",
        "content": "Việt Nam Tuyên truyền Giải phóng quân là tên của đội quân chủ lực của Mặt trận Việt Minh từ tháng 12 năm 1944 đến tháng 5 năm 1945. Đây là tổ chức quân sự cùng với Cứu quốc quân được xem là tiền thân của Quân đội nhân dân Việt Nam. Ngày thành lập Việt Nam Tuyên truyền Giải phóng quân, 22 tháng 12, sau này đã được chọn làm ngày truyền thống của Quân đội nhân dân Việt Nam.",
        "thoiky": "phapthuoc"
    },
    {
        "year": "T3-1945",
        "title": "Nhật đảo chính thực dân Pháp",
        "content": "",
        "thoiky": "phapthuoc"
    },
    {
        "year": "14/8/1945 - 30/8/1945 ",
        "title": "Cách mạng tháng 8",
        "content": "Cách mạng tháng Tám còn gọi là Tổng khởi nghĩa tháng Tám là tên gọi ngành sử học chính thống tại Việt Nam hiện nay dùng để chỉ việc phong trào Việt Minh tiến hành khởi nghĩa chống Đế quốc Nhật Bản, buộc Đế quốc Việt Nam bàn giao chính quyền trung ương và các địa phương và buộc Bảo Đại phải thoái vị trong tháng 8 năm 1945.",
        "thoiky": "phapthuoc"
    },
    {
        "year": "2/9/1945",
        "title": "thành lập nước Việt Nam Dân chủ Cộng hòa",
        "content": "2 tháng 9 Hồ Chí Minh tuyên bố độc lập, thành lập nước Việt Nam Dân chủ Cộng hòa",
        "thoiky": "khangchien"
    },
    {
        "year": "8/9/1945",
        "title": "8 tháng 9 phát động phong trào Bình dân học vụ",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "23/9/1945",
        "title": "Pháp nổ súng tại Sài Gòn",
        "content": "23 tháng 9 quân Pháp nổ súng tại Sài Gòn, bắt đầu cuộc chiến tranh xâm lược Việt Nam lần 2",
        "thoiky": "khangchien"
    },
    {
        "year": "23/9/1945",
        "title": "Trần Văn Giàu kêu gọi Nam Bộ kháng chiến",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "6/1/1946",
        "title": "Tổng tuyển cử bầu Quốc hội đầu tiên",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "26/3/1946",
        "title": "Pháp lập nên Cộng hòa Tự trị Nam Kỳ thuộc Liên hiệp Pháp, thủ đô Sài Gòn",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "14/9/1946",
        "title": "Tạm ước Việt - Pháp",
        "content": "Tạm ước Việt – Pháp hay Thỏa hiệp án Việt – Pháp là một ký kết tạm thời (thuật ngữ ngoại giao viết theo tiếng Latinh: modus vivendi) được ký ngày 14 tháng 9 năm 1946 giữa đại diện Cộng hòa Pháp là Marius Moutet và đại diện Việt Nam Dân chủ Cộng hòa là Hồ Chí Minh. ",
        "thoiky": "khangchien"
    },
    {
        "year": "9/11/1946",
        "title": "hiến pháp đầu tiên của nước Việt Nam độc lập",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "19/12/1946",
        "title": "Hồ Chí Minh kêu gọi Toàn quốc kháng chiến",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "7/10/1947-22/12/1947",
        "title": "Chiến dịch Việt Bắc Thu - Đông 1947",
        "content": "Chiến dịch Việt Bắc Thu - Đông 1947 là chiến dịch phản công của lực lượng vũ trang nước Việt Nam Dân chủ Cộng hòa trước Cuộc hành quân Léa do quân đội Pháp thực hiện tại phía Bắc Việt Nam trong Chiến tranh Đông Dương.",
        "thoiky": "khangchien"
    },
    {
        "year": "14/6/1949",
        "title": "Pháp lập nên Quốc gia Việt Nam",
        "content": "14 tháng 6 Pháp lập nên Quốc gia Việt Nam, quốc trưởng Bảo Đại, thủ đô Sài Gòn",
        "thoiky": "khangchien"
    },
    {
        "year": "8/5/1950",
        "title": "Mỹ bắt đầu can thiệp quân sự vào Việt Nam",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "16/9/1950-17/10/1950",
        "title": "Chiến dịch Biên giới",
        "content": "Chiến dịch Biên giới Thu đông 1950, còn gọi là Chiến dịch Lê Hồng Phong 2, là một chiến dịch trong Chiến tranh Đông Dương do Quân đội nhân dân Việt Nam (được phía Pháp gọi là Việt Minh) thực hiện từ ngày 16 tháng 9 đến 14 tháng 10 năm 1950 nhằm phá vòng vây mà quân viễn chinh của Đệ Tứ Cộng hòa Pháp bố trí nhằm cô lập các căn cứ địa Việt Bắc. ",
        "thoiky": "khangchien"
    },
    {
        "year": "13/3/1954-7/5/1954",
        "title": "Chiến dịch Điện Biên Phủ",
        "content": "Đây là chiến thắng quân sự lớn nhất trong cuộc Chiến tranh Đông Dương (1945 – 1954) của Việt Nam. Với thắng lợi quyết định này, lực lượng Quân đội Nhân dân Việt Nam do Đại tướng Võ Nguyên Giáp chỉ huy đã buộc quân đội Pháp và Quốc Gia Việt Nam tại Điện Biên Phủ phải đầu hàng vào ngày 7 tháng 5 năm 1954, sau 2 tháng cầm cự.",
        "thoiky": "khangchien"
    },
    {
        "year": "20/7/1954",
        "title": "Hiệp định Genève",
        "content": "Pháp rút quân khỏi Việt Nam và đất nước bị chia cắt",
        "thoiky": "khangchien"
    },
    {
        "year": "10/10/1954",
        "title": "Giải phóng thủ đô",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "1955",
        "title": "Ngô Đình Diệm phế truất Bảo Đại, lên làm Tổng thống, lập nên Việt Nam Cộng hòa",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "1959–1960",
        "title": "Đồng Khởi là phong trào do những thành viên Việt Minh ở lại miền Nam Việt Nam kêu gọi nhân dân nổi dậy đồng loạt chống lại Hoa Kỳ và chính phủ Việt Nam Cộng hòa.",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "20/12/1960",
        "title": "thành lập Mặt trận Dân tộc Giải phóng miền Nam Việt Nam",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "15/12/1961",
        "title": "thành lập Quân Giải phóng miền Nam Việt Nam",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "1961–1965",
        "title": "chiến dịch Chiến tranh đặc biệt",
        "content": "Staley-Taylor là tên một kế hoạch thực thi chiến lược 'Chiến tranh đặc biệt' của Hoa Kỳ trong Cuộc chiến xâm lược Việt Nam. Kế hoạch này được công bố tháng 5 năm 1961, mang tên hai người soạn thảo là nhà kinh tế học Eugene Staley của Viện nghiên cứu Standford - đại học Stanford và Đại tướng Maxwell D.",
        "thoiky": "khangchien"
    },
    {
        "year": "1963",
        "title": "đảo chính lật đổ chính quyền Ngô Đình Diệm",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "8/3/1965",
        "title": "Mỹ bắt đầu đưa quân vào tham chiến tại miền Nam Việt Nam",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "1965–1968",
        "title": "chiến dịch Chiến tranh cục bộ",
        "content": "Chiến tranh cục bộ là một chiến lược quân sự của Hoa Kỳ trong Chiến tranh Việt Nam (giai đoạn 1965-1967). ",
        "thoiky": "khangchien"
    },
    {
        "year": "1968–1973",
        "title": "chiến dịch Việt Nam hóa chiến tranh",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "2/9/1969",
        "title": "Chủ tịch Hồ Chí Minh từ trần",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "18/12/1972-30/12/1972",
        "title": "Chiến dịch Điện Biên Phủ trên không",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "27/1/1973",
        "title": "Hiệp định Paris, Mỹ rút quân khỏi Việt Nam",
        "content": "",
        "thoiky": "khangchien"
    },
    {
        "year": "26/4/1975-2/5/1975",
        "title": "Chiến dịch Hồ Chí Minh",
        "content": "Chiến dịch Hồ Chí Minh, tên ban đầu là Chiến dịch Giải phóng Sài Gòn – Gia Định là chiến dịch cuối cùng của Quân Giải phóng miền Nam Việt Nam trong Cuộc Tổng tấn công và nổi dậy mùa Xuân năm 1975 và Chiến tranh Việt Nam.",
        "thoiky": "khangchien"
    },
    {
        "year": "30/4/1975",
        "title": "kết thúc Chiến tranh Việt Nam",
        "content": "chính phủ Việt Nam Cộng hòa đầu hàng vô điều kiện Cộng hòa Miền Nam Việt Nam, kết thúc Chiến tranh tại Việt Nam",
        "thoiky": "khangchien"
    },
    {
        "year": "2/7/1976",
        "title": "đổi tên nước thành Cộng hòa xã hội chủ nghĩa Việt Nam",
        "content": "",
        "thoiky": "doimoi"
    },
    {
        "year": "20/9/1977",
        "title": "gia nhập Liên Hợp Quốc",
        "content": "Liên Hợp Quốc được thành lập vào giai đoạn cuối Thế chiến II với mục đích ngăn chặn các cuộc xung đột quy mô toàn cầu trong tương lai và thay thế cho một tổ chức đã giải thể trong quá khứ là Hội Quốc Liên vốn hoạt động không mấy hiệu quả.",
        "thoiky": "doimoi"
    },
    {
        "year": "1975–1979",
        "title": "chiến tranh biên giới Tây Nam",
        "content": "Là cuộc xung đột quân sự giữa Cộng hòa Xã hội chủ nghĩa Việt Nam và Campuchia Dân chủ.",
        "thoiky": "doimoi"
    },
    {
        "year": "1979",
        "title": "chiến tranh biên giới phía Bắc",
        "content": "Chiến tranh biên giới 1979, hay thường được gọi là Chiến tranh biên giới Việt – Trung năm 1979, là một cuộc chiến ngắn nhưng khốc liệt giữa Trung Quốc và Việt Nam, diễn ra vào ngày 17 tháng 2 năm 1979 khi Trung Quốc đưa quân tấn công Việt Nam trên toàn tuyến biên giới giữa 2 nước.",
        "thoiky": "doimoi"
    },
    {
        "year": "18/12/1986",
        "title": "bắt đầu Đổi Mới",
        "content": "Đổi Mới là một chương trình cải cách toàn diện, đặc biệt là trong lĩnh vực kinh tế, chính trị và nhiều khía cạnh khác của đời sống xã hội được thực hiện tại Việt Nam từ cuối thập niên 1980. ",
        "thoiky": "doimoi"
    },
    {
        "year": "14/3/1988",
        "title": "Xung đột Trường Sa",
        "content": "Trung Quốc chiến được đá Gạc Ma, Việt Nam giữ được đá Cô Lin và đá Len Đao",
        "thoiky": "doimoi"
    },
    {
        "year": "7/11/1991",
        "title": "bình thường hóa quan hệ với Trung Quốc",
        "content": "",
        "thoiky": "doimoi"
    },
    {
        "year": "11/7/1995",
        "title": "bình thường hóa quan hệ với Mỹ",
        "content": "",
        "thoiky": "doimoi"
    },
    {
        "year": "28/7/1995",
        "title": "gia nhập ASEAN",
        "content": "",
        "thoiky": "doimoi"
    },
    {
        "year": "14/11/1998",
        "title": "gia nhập APEC",
        "content": "",
        "thoiky": "doimoi"
    },
    {
        "year": "11/1/2007",
        "title": "gia nhập WTO",
        "content": "",
        "thoiky": "doimoi"
    },
    {
        "year": "28/11/2013",
        "title": "gthông qua Hiến pháp 2013",
        "content": "",
        "thoiky": "doimoi"
    },
    {
        "year": "2020–2023",
        "title": "Đại dịch COVID-19",
        "content": "Vào ngày 23 tháng 1 năm 2020, trường hợp đầu tiên mắc COVID-19 do virus SARS-CoV-2 gây ra được xác nhận tại Thành phố Hồ Chí Minh, Việt Nam. Xã hội, kinh tế bị tác động bởi đại dịch. Các hoạt động kiểm soát đã diễn ra trong đó có hạn chế tự do di chuyển. Tính đến ngày 15 tháng 1 năm 2024, Việt Nam ghi nhận 11.625.195 trường hợp nhiễm COVID-19 và 43.206 trường hợp tử vong. Tuy nhiên số ca nhiễm thực tế của một số tỉnh có thể cao gấp 4-5 lần số liệu Bộ Y tế công bố.",
        "thoiky": "doimoi"
    }
]